<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"2b99f986abf50ebc228e3216c9eb50f3d9133ac26c24d2fa36d77f27928d53fe","plan_job_ref":"Job terraform Workflow new #34 at https://github.com/GlueOps/venkat-tofu-testing/actions/runs/8103857721","plan_out_hash":"7261816474680f0105b76f09379a55a2b1824cedb6ac0fb2d3087b318301c44c","plan_hash":"ae33eeb48b06e342dceb537aed7a12aba778930512eb150ca4f9ed7c52f62c7d","plan_text_format":"diff","version":"1.41.2","closed":true} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudflare_record.fake-domain-record will be created
+   resource "cloudflare_record" "fake-domain-record" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "yolooooooooo"
+       proxiable       = (known after apply)
+       ttl             = 3600
+       type            = "A"
+       value           = "8.8.8.8"
+       zone_id         = "********************************"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [terraform Workflow new #35](https://github.com/GlueOps/venkat-tofu-testing/actions/runs/8103869364)